
# #t분포 --------------------------------------------------------------------
qt(0.9,2)
qt(0.9,10)
qt(1-0.05,9)

# #모평균 추론 -----------------------------------------------------------------

n = 15
xbar = 39.3
s = 2.6
L = xbar-qt(1-0.05,14)*(s/sqrt(n))
U = xbar+qt(1-0.05,14)*(s/sqrt(n))

print(c(L,U))

# #교수님 풀이 -----------------------------------------------------------------

n = 15
xbar = 39.3
s = 2.6
alpha = 0.1

# #예제4 --------------------------------------------------------------------

x = c(175,190,215,198,184,207,210,193,196,180)
mean(x)

xbar = mean(x)
s = sd(x) ##표준편차 구하기
n = length(x)
mu0 = 200
alpha = 0.05

t0 = (xbar - mu0)/(s/sqrt(n))
t_alpha = qt(1-alpha,n-1)
pvalue = pt(t0,n-1)

if(t0 <= -t_alpha){
  print("기각")
} else{
  print("기각 ㄴㄴ")
}

print(c(t0,t_alpha,pvalue))


# 예제5 ---------------------------------------------------------------------

n = 9
xbar = 8.3
s = 1.2
alpha = 0.05
t_alpha_2 = qt(1-alpha/2,n-1)
mu0 = 8.5
t0 = (xbar-mu0)*(s/sqrt(n))
L = (xbar - t_alpha_2*(s/sqrt(n)))
U = (xbar + t_alpha_2*(s/sqrt(n)))
print(c(L,U))

if(abs(t0)>= t_alpha_2){
  print("기각")
} else{
  print("기각 ㄴㄴ")
}

